In [2]:
import pandas as pd
import numpy as np

In [7]:
df = pd.DataFrame(
{"key1": list("aabbab"),
 "key2":['one', 'two', 'three']*2,
'data1':np.random.randn(6), 
 'data2':np.random.randn(6)}
 )

df

  key1   key2     data1     data2
0    a    one -0.897355  2.113441
1    a    two  0.186839 -0.099142
2    b  three -0.898161  0.057614
3    b    one  0.757097 -0.030078
4    a    two  0.285703  0.691996
5    b  three -0.161288 -0.247826

In [10]:
group = df['data1'].groupby(df["key1"])
group

In [11]:
group.mean()

key1
a   -0.141604
b   -0.100784
Name: data1, dtype: float64

In [12]:
ave = df["data1"].groupby([df['key1'], 
                           df["key2"]]).mean()
ave

key1  key2
a     one     -0.897355
      two      0.236271
b     one      0.757097
      three   -0.529724
Name: data1, dtype: float64

In [13]:
ave.unstack()

key2       one     three       two
key1
a    -0.897355       NaN  0.236271
b     0.757097 -0.529724       NaN

In [18]:
df

  key1   key2     data1     data2
0    a    one -0.897355  2.113441
1    a    two  0.186839 -0.099142
2    b  three -0.898161  0.057614
3    b    one  0.757097 -0.030078
4    a    two  0.285703  0.691996
5    b  three -0.161288 -0.247826

In [19]:
df.groupby(["key1", "key2"]).mean()

               data1     data2
key1 key2
a    one   -0.897355  2.113441
     two    0.236271  0.296427
b    one    0.757097 -0.030078
     three -0.529724 -0.095106

In [20]:
for name, group in df.groupby("key1"):
    print(name)
    print(group)

a
  key1 key2     data1     data2
0    a  one -0.897355  2.113441
1    a  two  0.186839 -0.099142
4    a  two  0.285703  0.691996
b
  key1   key2     data1     data2
2    b  three -0.898161  0.057614
3    b    one  0.757097 -0.030078
5    b  three -0.161288 -0.247826

In [22]:
for (x1, x2), group in df.groupby(["key1", "key2"]):
    print(x1, x2)
    print("-" * 60)
    print(group)

a one
------------------------------------------------------------
  key1 key2     data1     data2
0    a  one -0.897355  2.113441
a two
------------------------------------------------------------
  key1 key2     data1     data2
1    a  two  0.186839 -0.099142
4    a  two  0.285703  0.691996
b one
------------------------------------------------------------
  key1 key2     data1     data2
3    b  one  0.757097 -0.030078
b three
------------------------------------------------------------
  key1   key2     data1     data2
2    b  three -0.898161  0.057614
5    b  three -0.161288 -0.247826

In [23]:
piece = dict(list(df.groupby("key1")))

In [24]:
piece["a"]

  key1 key2     data1     data2
0    a  one -0.897355  2.113441
1    a  two  0.186839 -0.099142
4    a  two  0.285703  0.691996

In [25]:
piece["b"]

  key1   key2     data1     data2
2    b  three -0.898161  0.057614
3    b    one  0.757097 -0.030078
5    b  three -0.161288 -0.247826

In [26]:
piece

{'a':   key1 key2     data1     data2
 0    a  one -0.897355  2.113441
 1    a  two  0.186839 -0.099142
 4    a  two  0.285703  0.691996,
 'b':   key1   key2     data1     data2
 2    b  three -0.898161  0.057614
 3    b    one  0.757097 -0.030078
 5    b  three -0.161288 -0.247826}

In [27]:
df = pd.DataFrame({"key": list("ABC") * 2,
                 "data1": range(6), 
                  "data2": np.arange(5, 11)})
df

  key  data1  data2
0   A      0      5
1   B      1      6
2   C      2      7
3   A      3      8
4   B      4      9
5   C      5     10

In [28]:
group = df.groupby("key")

In [31]:
group.aggregate(["min", np.median, "max"])

C:\Users\Kiran\AppData\Local\Temp\ipykernel_16120\2383617389.py:1: FutureWarning: The provided callable <function median at 0x00000290C9D98220> is currently using SeriesGroupBy.median. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "median" instead.
  group.aggregate(["min", np.median, "max"])

    data1            data2
      min median max   min median max
key
A       0    1.5   3     5    6.5   8
B       1    2.5   4     6    7.5   9
C       2    3.5   5     7    8.5  10

In [32]:
group.agg({"data1":"min", "data2":"max"})

     data1  data2
key
A        0      8
B        1      9
C        2     10

In [33]:
def f(x):
    return x.max() - x.min()

In [34]:
group.agg(f)

     data1  data2
key
A        3      3
B        3      3
C        3      3

More than one function

In [35]:
data=pd.DataFrame({"letter":list("ABC")*4,
                   "num":["one","two"]*6,
                   "d1":np.random.randn(12),
                   "d2":np.arange(10,33,2)})
data

   letter  num        d1  d2
0       A  one -0.068968  10
1       B  two  0.609799  12
2       C  one -1.861552  14
3       A  two -2.340949  16
4       B  one  1.611259  18
5       C  two  2.033197  20
6       A  one -1.338654  22
7       B  two -0.692464  24
8       C  one -0.451873  26
9       A  two -0.973209  28
10      B  one -1.179767  30
11      C  two  0.160618  32

In [36]:
group = data.groupby(["letter", "num"])

In [38]:
group_d1 = group["d1"]

In [39]:
group_d1.agg("mean")

letter  num
A       one   -0.703811
        two   -1.657079
B       one    0.215746
        two   -0.041333
C       one   -1.156712
        two    1.096907
Name: d1, dtype: float64

In [40]:
group_d2 = group["d2"]

In [41]:
group_d2.agg("mean")

letter  num
A       one    16.0
        two    22.0
B       one    24.0
        two    18.0
C       one    20.0
        two    26.0
Name: d2, dtype: float64

In [42]:
group_d2.agg(["mean", "std", f])

            mean       std   f
letter num
A      one  16.0  8.485281  12
       two  22.0  8.485281  12
B      one  24.0  8.485281  12
       two  18.0  8.485281  12
C      one  20.0  8.485281  12
       two  26.0  8.485281  12

In [44]:
group_d2.agg([("f_mean", "mean"), ("f_std", np.std)])

C:\Users\Kiran\AppData\Local\Temp\ipykernel_16120\2164552030.py:1: FutureWarning: The provided callable <function std at 0x00000290C9A71760> is currently using SeriesGroupBy.std. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "std" instead.
  group_d2.agg([("f_mean", "mean"), ("f_std", np.std)])

            f_mean     f_std
letter num
A      one    16.0  8.485281
       two    22.0  8.485281
B      one    24.0  8.485281
       two    18.0  8.485281
C      one    20.0  8.485281
       two    26.0  8.485281